Repository: iulianstana/Flask-Miguel-Tutorial
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: ro

source: Please log in to access this page
ro: Logati-va pentru a accesa aceasta pagina

source: This nickname has invalid characters. Please use letters, numbers, dots and underscores only.
ro: Acest pseudonim a caractere nevalide. Vă rugăm folosiți litere, numere, puncte şi linii de subliniere numai.

source: This nickname is already in use. Please choose another one.
ro: Acest nickname este deja in uz. Va rugam sa alegeti un altul.

source: Error: translation service not configured.
ro: Eroare: serviciul de traducere nu este configurat.

source: Error: Unexpected error.
ro: Eroare: Eroare neaseptata.

source: Your post is now live
ro: Post-ul este acum live

source: Invalid login. Please try again
ro: Login invalid. Vă rugăm să încercaţi din nou

source: User %(nickname)s not found
ro: Utilizatorul %(nickname)s nu a fost gasit

source: Your changes have been saved
ro: Modificarile au fost salvate

source: User %(nickname)s not found.
ro: Utilizatorul %(nickname)s nu a fost gasit.

source: You can't follow yourself.
ro: Nu te poti urmarii singur.

source: Cannot follow %(nickname)s.
ro: Nu il poti urmari pe %(nickname)s.

source: You are now following %(nickname)s.
ro: Esti urmarit de %(nickname)s.

source: You can't unfollow yourself.
ro: Nu iti poti da unfollow.

source: You have stopped following %(nickname)s
ro: Nu il mai urmaresti pe %(nickname)s

source: Page Not Found
ro: Pagina nu poate fi gasita

source: Back
ro: Inapoi

source: An unexpected error has occurred
ro: A apărut o eroare neașteptată

source: The administrator has been notified. Sorry for the inconvenience!
ro: Administratorul a fost notificat. Ne pare rău pentru neplăcerile create!

source: Home
ro: Acasa

source: Your Profile
ro: Profilul tau

source: Search
ro: Cauta

source: Edit Your Profile
ro: Editeazati profilul

source: Your nickname
ro: Nickname-ul tau

source: About yourself
ro: Despre tine

source: Save Changes
ro: Salveaza Schimbarile

source: Dear %(nickname)s,
ro: Draga %(nickname)s,

source: %(nickname)s is now a follower.
ro: %(nickname)s este un urmaritor

source: Regards
ro: Toate cele bune

source: The <code>microblog</code> admin
ro: Cu respect administratorul

source: Hi, %(nickname)s!
ro: Salut, %(nickname)s!

source: Say something
ro: Spune ceva

source: Post!
ro: Posteaza!

source: Newer posts
ro: Postari noi

source: Older posts
ro: Postari vechi

source: Please Sign In
ro: Te rog sa te logezi

source: Click on your OpenID provider below
ro: Apasa providerul tau de OpenID

source: Or enter your OpenID here
ro: Sau introduce OpenID-ul aici

source: Remember Me
ro: Tine minte

source: %(nickname)s said %(when)s:
ro: %(nickname)s a spus %(when)s:

source: Translate
ro: Traduce

source: Search results for "%(query)s":
ro: Rezultatul pentru "%(query)s":

source: Last seen on:
ro: Ultima aparatie

source: Edit your profile
ro: Editaţi-vă profilul
